In [1]:
%pip install pandas

Requirement already satisfied: pandas in /Users/amiteshsinha/Training/2026_1_GenAI_Lab/.venv/lib/python3.13/site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in /Users/amiteshsinha/Training/2026_1_GenAI_Lab/.venv/lib/python3.13/site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/amiteshsinha/Training/2026_1_GenAI_Lab/.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /Users/amiteshsinha/Training/2026_1_GenAI_Lab/.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.1.1 -> 26.0
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
dataframe = pd.read_csv('data.csv')
dataframe

   order_id region  sales quarter     rep
0       101   West   1200      Q1    Alex
1       102   West   1500      Q2   Blake
2       103   East    800      Q1   Casey
3       104   East    600      Q3    Drew
4       105  South    900      Q2    Evan
5       106  South   1150      Q3   Flynn
6       107   West   2000      Q3    Gale
7       108  North    700      Q1  Hayden
8       109   East   1300      Q2    Indy
9       110   West   2200      Q4   Jules

In [3]:
dataframe.head()

   order_id region  sales quarter    rep
0       101   West   1200      Q1   Alex
1       102   West   1500      Q2  Blake
2       103   East    800      Q1  Casey
3       104   East    600      Q3   Drew
4       105  South    900      Q2   Evan

In [5]:
dataframe.tail()

   order_id region  sales quarter     rep
5       106  South   1150      Q3   Flynn
6       107   West   2000      Q3    Gale
7       108  North    700      Q1  Hayden
8       109   East   1300      Q2    Indy
9       110   West   2200      Q4   Jules

In [6]:
dataframe.describe()

        order_id        sales
count   10.00000    10.000000
mean   105.50000  1235.000000
std      3.02765   536.475121
min    101.00000   600.000000
25%    103.25000   825.000000
50%    105.50000  1175.000000
75%    107.75000  1450.000000
max    110.00000  2200.000000

In [7]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  10 non-null     int64
 1   region    10 non-null     str
 2   sales     10 non-null     int64
 3   quarter   10 non-null     str
 4   rep       10 non-null     str
dtypes: int64(2), str(3)
memory usage: 641.0 bytes

In [ ]:
# %pip install matplotlib sklearn